# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Import Libraries

In [5]:
import sqlite3
import pandas as pd
import numpy as np

## Connect to the Database

In [1]:
# Your code here
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [13]:
# Your code here
query = """
SELECT emp.firstName, emp.lastName, off.city, off.state
FROM employees as emp
JOIN offices AS off USING('officeCode')
ORDER BY emp.firstName, emp.lastName;
"""
cur.execute(query)
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results: ', len(df))
df.head()

Number of results:  23

  firstName lastName           city state
0      Andy   Fixter         Sydney
1   Anthony      Bow  San Francisco    CA
2     Barry    Jones         London
3     Diane   Murphy  San Francisco    CA
4  Foon Yue    Tseng            NYC    NY

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [15]:
# Your code here
query = """
SELECT cus.customerNumber, cus.contactFirstName, cus.contactLastName,
ord.orderNumber, ord.orderDate, ord.requiredDate, ord.shippedDate, ord.status
FROM customers as cus
JOIN orders AS ord USING('customerNumber')
ORDER BY cus.contactFirstName, cus.contactLastName;
"""
cur.execute(query)
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results: ', len(df))
df.head()

Number of results:  326

,customerNumber,contactFirstName,contactLastName,orderNumber,orderDate,requiredDate,shippedDate,status
0,282,Adrian,Huxley,10139,2003-07-16,2003-07-23,2003-07-21,Shipped
1,282,Adrian,Huxley,10270,2004-07-19,2004-07-27,2004-07-24,Shipped
2,282,Adrian,Huxley,10361,2004-12-17,2004-12-24,2004-12-20,Shipped
3,282,Adrian,Huxley,10420,2005-05-29,2005-06-07,,In Process
4,398,Akiko,Shimamura,10258,2004-06-15,2004-06-25,2004-06-23,Shipped

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [17]:
# Your code here
query = """
SELECT cus.customerNumber, cus.contactFirstName, cus.contactLastName,
pay.paymentDate, pay.amount
FROM customers as cus
JOIN payments AS pay USING('customerNumber')
ORDER BY cus.contactFirstName, cus.contactLastName;
"""
cur.execute(query)
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results: ', len(df))
df.head()

Number of results:  273

   customerNumber contactFirstName contactLastName paymentDate    amount
0             282           Adrian          Huxley  2003-08-03  24013.52
1             282           Adrian          Huxley  2004-08-02  35806.73
2             282           Adrian          Huxley  2005-01-03  31835.36
3             398            Akiko       Shimamura  2004-06-21  22037.91
4             398            Akiko       Shimamura  2004-11-29  48927.64

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [19]:
# Your code here
query = """
SELECT cus.customerNumber, cus.contactFirstName, cus.contactLastName,
pro.productCode, pro.productName,
od.orderNumber, od.quantityOrdered, od.priceEach,
ord.orderDate
FROM customers AS cus
JOIN orders AS ord USING('customerNumber')
JOIN orderdetails AS od USING('orderNumber')
JOIN products AS pro USING('productCode')
"""
cur.execute(query)
df = pd.DataFrame(cur.fetchall())
df.columns = [columnDescription[0] for columnDescription in cur.description]
print('Number of results: ', len(df))
df.head()

Number of results:  2996

,customerNumber,contactFirstName,contactLastName,productCode,productName,orderNumber,quantityOrdered,priceEach,orderDate
0,103,Carine,Schmitt,S18_1589,1965 Aston Martin DB5,10123,26,120.71,2003-05-20
1,103,Carine,Schmitt,S18_2870,1999 Indy 500 Monte Carlo SS,10123,46,114.84,2003-05-20
2,103,Carine,Schmitt,S18_3685,1948 Porsche Type 356 Roadster,10123,34,117.26,2003-05-20
3,103,Carine,Schmitt,S24_1628,1966 Shelby Cobra 427 S/C,10123,50,43.27,2003-05-20
4,103,Carine,Schmitt,S10_2016,1996 Moto Guzzi 1100i,10298,39,105.86,2004-09-27

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!